### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.web_server[1].aws_instance.this will be created
+   resource "aws_instance" "this" {
+       ami                                  = "ami-05ffe3c48a9991133"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       enable_primary_ipv6                  = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       region                               = "us-east-1"
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = "subnet-0fdfb5252ab10392f"
+       tags                                 = {
+           "CostCenter"  = "default-team"
+           "Creator"     = "reetwizamatya"
+           "Environment" = "Default"
+           "Name"        = "reetwiz-instance-2"
        }
+       tags_all                             = {
+           "CostCenter"  = "default-team"
+           "Creator"     = "reetwizamatya"
+           "Environment" = "Default"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "reetwiz-instance-2"
+           "Project"     = "reetwiz"
        }
+       tenancy                              = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)
    }

  # module.web_server[1].aws_security_group.instance_sg will be created
+   resource "aws_security_group" "instance_sg" {
+       arn                    = (known after apply)
+       description            = "Allow SSH inbound and all outbound traffic"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 22
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
+       name                   = "reetwiz-instance-2-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       region                 = "us-east-1"
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "reetwiz-instance-2-sg"
        }
+       tags_all               = {
+           "Creator"   = "reetwizamatya"
+           "ManagedBy" = "Terraform"
+           "Name"      = "reetwiz-instance-2-sg"
+           "Project"   = "reetwiz"
        }
+       vpc_id                 = "vpc-0eb2d01c37cc93e40"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>